import otherstyles from "../styles/othernews.module.css";
import { NewsDate } from "@/components/NewsDate";
const otherArr = [
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326273-23122024-1734924694-1795735268-jkldg.jpg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "1",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2019/07/02/autobus32-122353-12711223431.jpeg",
    h2: "Нэгдүгээр сарын 1-нээс иргэд автобусанд 1000 төгрөг төлж зорчино",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ.",
    share: "25",
    min: "1 цаг 31 минутын өмнө",
    key: "1",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326270-23122024-1734926621-1424882697-tog_togtasralt-9-161210-13176783251.jpeg",
    h2: "Өнөөдөр цахилгаан таслах хуваарь",
    des: " НИТХ-аас өнгөрсөн хоёрдугаар сард тогтоол гаргаж, нийтийн тээврээр үйлчлүүлэх үнийн тарифт зарим өөрчлөлт оруулсан.  2025 ",
    share: "4",
    min: "48 минутын өмнө",
    key: "1",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/420/np/2024/05/31/5213884/huuhduud_suragch_angi_hicheel%20(1)-172630-9609077511.jpeg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2019/07/02/autobus32-122353-12711223431.jpeg",
    h2: "Өнөөдрөөс I, II ангийн сурагчдын амралт эхэллээ",
    des: "Өнөөдөр буюу 2024 оны арванхоёрдугаар сарын 23-наас бага ангийн сурагчдын амралт эхэлж байна.",
    share: "1",
    min: "56 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/420/images/c/2024/12/326269-23122024-1734921376-1072106808-tog_tas1.jpg",
    h2: "Тог тасраад гэрийнхэнтэйгээ илүү дотно танилцлаа",
    des: "Тог тасарсан биш гэрийнхэнтэйгээ илүү дотно танилцлаа. Их дажгүй хүмүүс байдаг юм байна штээ эх хошигнолыг та өмнө нь ",
    share: "30",
    min: "48 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326267-23122024-1734915934-1122102442-Trump-1-511-1734901388.jpg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2019/07/02/autobus32-122353-12711223431.jpeg",
    h2: "Өнөөдрөөс I, II ангийн сурагчдын амралт эхэллээ",
    des: "Өнөөдөр буюу 2024 оны арванхоёрдугаар сарын 23-наас бага ангийн сурагчдын амралт эхэлж байна.",
    share: "1",
    min: "56 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2022/01/25/bayanhongor-135622-698082044.jpeg",
    h2: "Тог тасраад гэрийнхэнтэйгээ илүү дотно танилцлаа",
    des: "Тог тасарсан биш гэрийнхэнтэйгээ илүү дотно танилцлаа. Их дажгүй хүмүүс байдаг юм байна штээ эх хошигнолыг та өмнө нь ",
    share: "30",
    min: "48 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/images/ck/2024/12/23/zurag_1-084634-881226848.jpeg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2024/12/09/5222492/utaa_gerhoroolol_agaariinbohirdol-7-164358-4935227461.jpeg",
    h2: "Өнөөдрөөс I, II ангийн сурагчдын амралт эхэллээ",
    des: "Өнөөдөр буюу 2024 оны арванхоёрдугаар сарын 23-наас бага ангийн сурагчдын амралт эхэлж байна.",
    share: "1",
    min: "56 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/-15122024-1734237483-1665066555--28102024-1730083022-219335717-299122-19102022-1666136412-1894119943-Tsas_guntiindawaa_gunt_(5)-122412-9393983041.jpeg",
    h2: "Тог тасраад гэрийнхэнтэйгээ илүү дотно танилцлаа",
    des: "Тог тасарсан биш гэрийнхэнтэйгээ илүү дотно танилцлаа. Их дажгүй хүмүүс байдаг юм байна штээ эх хошигнолыг та өмнө нь ",
    share: "30",
    min: "48 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326263-23122024-1734913595-1490132901-470788879_900791165547626_5932950885749074438_n.jpg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/np/2024/12/03/5222165/gatsuur%20mod%20suld%20mod04121-144101-196621320111.jpeg",
    h2: "Өнөөдрөөс I, II ангийн сурагчдын амралт эхэллээ",
    des: "Өнөөдөр буюу 2024 оны арванхоёрдугаар сарын 23-наас бага ангийн сурагчдын амралт эхэлж байна.",
    share: "1",
    min: "56 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326261-22122024-1734847118-737735224-f23089a3-7697-4629-9927-129f9ffa1f48.jpg",
    h2: "Тог тасраад гэрийнхэнтэйгээ илүү дотно танилцлаа",
    des: "Тог тасарсан биш гэрийнхэнтэйгээ илүү дотно танилцлаа. Их дажгүй хүмүүс байдаг юм байна штээ эх хошигнолыг та өмнө нь ",
    share: "30",
    min: "48 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326259-22122024-1734842981-234014482-Screenshot_2024-12-22_124910.jpeg",
    h2: " Сар эсвэл Ангараг дээрх бидний ирээдүйн гэр ийм байх боломжтой гэв",
    des: "Энэхүү өндөг хэлбэртэй гэр нь сансарт ажиллах Энэтхэгийн сансрын нисгэгчдийн ирээдүйн орон гэр болох боломжтой гэжээ. Hab-1 буюу Habitat-1 нь Энэтхэгийн сансрын агентлаг ирээдүйн сансрын нисгэгчд",
    share: "1",
    min: "17 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/325871-19122024-1734569275-989772350-chuulgan_202412.11.jpg",
    h2: "Өнөөдрөөс I, II ангийн сурагчдын амралт эхэллээ",
    des: "Өнөөдөр буюу 2024 оны арванхоёрдугаар сарын 23-наас бага ангийн сурагчдын амралт эхэлж байна.",
    share: "1",
    min: "56 минутын өмнө",
    key: "2",
  },
  {
    img: "https://mgl.gogo.mn/newsn/thumbnail/1000/images/c/2024/12/326258-22122024-1734840688-1109645337-Screenshot_2024-12-22_121056.jpeg",
    h2: "Тог тасраад гэрийнхэнтэйгээ илүү дотно танилцлаа",
    des: "Тог тасарсан биш гэрийнхэнтэйгээ илүү дотно танилцлаа. Их дажгүй хүмүүс байдаг юм байна штээ эх хошигнолыг та өмнө нь ",
    share: "30",
    min: "48 минутын өмнө",
    key: "2",
  },
];
export const OtherNews = () => {
  return (
    <div className={otherstyles.allOtherNews}>
      <NewsDate />
      {otherArr
        .filter((news) => news.key == "1")
        .map((news) => {
          return (
            <div className={otherstyles.othernews}>
              <div className={otherstyles.otherLeft}>
                <img src={news.img} alt="" />
              </div>
              <div className={otherstyles.otherRight}>
                <div className={otherstyles.otherLeft}>
                  <h2 className={otherstyles.h2}>{news.h2}</h2>
                  <p className={otherstyles.p}>{news.des}</p>
                  <div className={otherstyles.icons}>
                    <div className={otherstyles.share}>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 512 512"
                      >
                        <path d="M307 34.8c-11.5 5.1-19 16.6-19 29.2l0 64-112 0C78.8 128 0 206.8 0 304C0 417.3 81.5 467.9 100.2 478.1c2.5 1.4 5.3 1.9 8.1 1.9c10.9 0 19.7-8.9 19.7-19.7c0-7.5-4.3-14.4-9.8-19.5C108.8 431.9 96 414.4 96 384c0-53 43-96 96-96l96 0 0 64c0 12.6 7.4 24.1 19 29.2s25 3 34.4-5.4l160-144c6.7-6.1 10.6-14.7 10.6-23.8s-3.8-17.7-10.6-23.8l-160-144c-9.4-8.5-22.9-10.6-34.4-5.4z" />
                      </svg>
                      <p>{news.share}</p>
                    </div>
                    <div className={otherstyles.min}>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 512 512"
                      >
                        <path d="M256 0a256 256 0 1 1 0 512A256 256 0 1 1 256 0zM232 120l0 136c0 8 4 15.5 10.7 20l96 64c11 7.4 25.9 4.4 33.3-6.7s4.4-25.9-6.7-33.3L280 243.2 280 120c0-13.3-10.7-24-24-24s-24 10.7-24 24z" />
                      </svg>
                      <p>{news.min}</p>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          );
        })}
      <div className={otherstyles.rec}>
        <img
          src="https://golomtbank.com/wp-content/uploads/2024/12/Card-25-cashback.png"
          alt=""
        />
      </div>
      {otherArr
        .filter((news) => news.key == "2")
        .map((news) => {
          return (
            <div className={otherstyles.othernews}>
              <div className={otherstyles.otherLeft}>
                <img src={news.img} alt="" />
              </div>
              <div className={otherstyles.otherRight}>
                <div className={otherstyles.otherLeft}>
                  <h2 className={otherstyles.h2}>{news.h2}</h2>
                  <p className={otherstyles.p}>{news.des}</p>
                  <div className={otherstyles.icons}>
                    <div className={otherstyles.share}>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 512 512"
                      >
                        <path d="M307 34.8c-11.5 5.1-19 16.6-19 29.2l0 64-112 0C78.8 128 0 206.8 0 304C0 417.3 81.5 467.9 100.2 478.1c2.5 1.4 5.3 1.9 8.1 1.9c10.9 0 19.7-8.9 19.7-19.7c0-7.5-4.3-14.4-9.8-19.5C108.8 431.9 96 414.4 96 384c0-53 43-96 96-96l96 0 0 64c0 12.6 7.4 24.1 19 29.2s25 3 34.4-5.4l160-144c6.7-6.1 10.6-14.7 10.6-23.8s-3.8-17.7-10.6-23.8l-160-144c-9.4-8.5-22.9-10.6-34.4-5.4z" />
                      </svg>
                      <p>{news.share}</p>
                    </div>
                    <div className={otherstyles.min}>
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 512 512"
                      >
                        <path d="M256 0a256 256 0 1 1 0 512A256 256 0 1 1 256 0zM232 120l0 136c0 8 4 15.5 10.7 20l96 64c11 7.4 25.9 4.4 33.3-6.7s4.4-25.9-6.7-33.3L280 243.2 280 120c0-13.3-10.7-24-24-24s-24 10.7-24 24z" />
                      </svg>
                      <p>{news.min}</p>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          );
        })}
      <div className={otherstyles.next}>
        <p>Цааш үзэх</p>
        <img
          src="https://mgl.gogo.mn//newsn/v4/images/more.50d348c2.png"
          alt=""
        />
      </div>
    </div>
  );
};
